# Эти задачи необходимо решить используя регулярные выражения!

# Задача - 1
# Запросите у пользователя имя, фамилию, email. Теперь необходимо совершить проверки, имя и фамилия должны иметь заглавные первые буквы.
# email - не должен иметь заглавных букв и должен быть в формате: текст в нижнем регистре, допускается нижнее подчеркивание и цифры, потом @, потом текст, допускаются цифры, точка, ru или org или com.
# Например:
# Пупкин василий - неверно указано имя, te$T@test.net - неверно указан email (спецсимвол, заглавная буква, .net), te_4_st@test.com - верно указан.

import re


def check(text, pattern):
    if re.findall(pattern, text):
        print(text, '- указано верно')
    else:
        print(text, '- указано неверно')


name_pattern = '^[А-Я][а-я]+$'
surname_pattern = '^[А-Я][а-я]+$'
email_pattern = '^[a-z_0-9]+@[a-z0-9]+\.ru|org|com$'

name = input('Введите имя: ')
surname = input('Введите фамилию: ')
email = input('Введите email: ')

check(name, name_pattern,)
check(surname, surname_pattern)
check(email, email_pattern)



# Задача - 2:
# Вам дан текст:

# пустая строка + отделяющая линия
print()
print('_' * 100)
print()


some_str = '''
Мороз и солнце; день чудесный!
Еще ты дремлешь, друг прелестный —
Пора, красавица, проснись:
Открой сомкнуты негой взоры
Навстречу северной Авроры,
Звездою севера явись!
Вечор, ты помнишь, вьюга злилась,
На мутном небе мгла носилась;
Луна, как бледное пятно,
Сквозь тучи мрачные желтела,
И ты печальная сидела —
А нынче... погляди в окно:
Под голубыми небесами
Великолепными коврами,
Блестя на солнце, снег лежит;
Прозрачный лес один чернеет,
И ель сквозь иней зеленеет,
И речка подо льдом блестит.
Вся комната янтарным блеском
Озарена. Веселым треском
Трещит затопленная печь.
Приятно думать у лежанки.
Но знаешь: не велеть ли в санки
Кобылку бурую запречь?
Скользя по утреннему снегу,
Друг милый, предадимся бегу
Нетерпеливого коня
И навестим поля пустые,
Леса, недавно столь густые,
И берег, милый для меня.'''

# Необходимо с помощью регулярных выражений определить есть ли в тексте подряд
# более одной точки, при любом исходе сообщите результат пользователю!

text_pattern = '\.\.'
if re.search(text_pattern, some_str):
    print('В тексте есть подряд более одной точки')
else:
    print('В тексте нет подряд более одной точки')